experiments/006_bluntedCone_rhoCentralFoam_uncomplete/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    object
    {
        // Boundary condition for turbulent thermal diffusivity when using wall 
        // functions.
        type            compressible::alphatWallFunction; 
        Prt             0.85; // Turbulent Prandtl number. 
        value           uniform 0;
    }		
    bottom
    {
    	type		symmetryPlane;
    }
  
    
    
    
/*    
    front_and_back
    {
        type            empty;
    }
    vehicle
    {
        // Boundary condition for turbulent thermal diffusivity when using wall 
        // functions.
        type            compressible::alphatWallFunction; 
        Prt             0.85; // Turbulent Prandtl number. 
        value           uniform 0;
    }

    tunnel
    {
        type            slip;
    }
    wedge0
    {
        type            wedge;
    }
    wedge1
    {
        type            wedge;
    }
    */
}


// ************************************************************************* //
