experiments/006_bluntedCone_rhoCentralFoam_uncomplete/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "inputs"

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $turbulentEpsilon;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    object
    {
        type            epsilonWallFunction;
        // Cmu             0.09;
        // kappa           0.41;
        // E               9.8;
        value           $internalField;
    }		
    bottom
    {
    	type		symmetryPlane;
    }
    
    
    
/*  
    front_and_back
    {
        type            empty;
    }
    vehicle
    {
        type            epsilonWallFunction;
        // Cmu             0.09;
        // kappa           0.41;
        // E               9.8;
        value           $internalField;
    }

    tunnel
    {
        type            slip;
    }
    wedge0
    {
        type            wedge;
    }
    wedge1
    {
        type            wedge;
    }
*/
}


// ************************************************************************* //
