experiments/006_bluntedCone_rhoCentralFoam_uncomplete/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      initialConditions;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Ttr       144.4;
Tve       $Ttr;
TveAtom   0;
Tcone     297.2;

pressureInlet  21.9139;
pressureField  $pressureInlet;

rhoInlet       0.00051131;

velocityInlet  2764.5;
velocityField  (0 0 0);
velocityWall   (0 0 0);

Y_N2      1.0;
Y_O2      0;
Y_NO      0;
Y_N       0;
Y_O       0;
Y_N2+     0;
Y_O2+     0;
Y_NO+     0;
Y_N+      0;
Y_O+      0;
Y_e-      0;
  


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
