experiments/006_bluntedCone_rhoCentralFoam_uncomplete/0/inputs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
speed             (825 0 0); // m/s 
temperature       270; // Kelvin
pressure          76; // Pascals
turbulentKE       1000; // k
turbulentEpsilon  25000; // epsilon

// ************************************************************************* //
