experiments/006_bluntedCone_rhoCentralFoam_uncomplete/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    object
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }		
    bottom
    {
    	type		symmetryPlane;
    }
 //   vehicle
 //   {
 //       type            nutkWallFunction;
 //      Cmu             0.09;
 //       kappa           0.41;
 //       E               9.8;
 //       value           uniform 0;
 //   }
//
//  tunnel
//    {
//        type            slip;
//    }
//    wedgel
//    {
//        type            wedge;
//    }
//    wedger
//    {
//        type            wedge;
//    }
}


// ************************************************************************* //
